---
kind: other
id: Methods.T:Autodesk.Revit.DB.ModelEllipse
source: html/32228c5a-2654-9216-191e-ec63d706ffeb.htm
---
# ModelEllipse Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.